Mistress-Lukutar/tptcm_wifi_bridge/sdkconfig.defaults
# TPTCM WiFi Bridge - sdkconfig defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Flash: ESP32-S3-WROOM-1-N8R8 has 8 MB flash (plus 8 MB octal PSRAM)
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Partition table: two OTA slots (see partitions.csv) for WiFi
# firmware updates. Migrating from the stock single-factory layout
# takes one USB flash; NVS keeps its offset so credentials survive.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Roll back to the previous OTA slot when a freshly flashed app fails
# to confirm itself with esp_ota_mark_app_valid_cancel_rollback().
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# The log tee (log_stream component) formats every ESP_LOG line on
# the logging task's stack; give the event loop task headroom.
CONFIG_ESP_EVENT_LOOP_TASK_STACK_SIZE=4096

# Main task stack: WiFi + HTTP provisioning needs more than the default
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS tick
CONFIG_FREERTOS_HZ=1000

# Cap WiFi TX power at 10 dBm in the PHY init data (applies from RF
# calibration onward): at the default 20 dBm the PA current spikes sag
# the AMS1117-fed 3.3 V rail and the SoftAP stays invisible to phones
# (esp-idf#13508). Runtime cap: CONFIG_TPTCM_WIFI_MAX_TX_POWER.
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=10
CONFIG_ESP_PHY_MAX_TX_POWER=10
